[
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "What is a learnathon?",
		"content": "A day of learning! You will have the opportunity to attend a day of workshops in your chosen track: Start Hacking, Beginner Web Dev, Advanced Web Dev, Game Dev, and Hardware. See the tracks section above for more info. Beyond track-specific workshops, we'll also have auxiliary workshops, tech talks, an organization fair, and more."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "What is a hackathon?",
		"content": "A chance to build an amazing computer science project! Students who attend the learnathon will apply their newly-acquired skills to create something they can call their own. Websites and mobile apps are common hacks, but you can build anything. We encourage you to think outside the box!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "How much experience do I need to attend?",
		"content": "Zero computer science, coding, or hacking experience is needed! We encourage students of all skill levels to apply—many of our workshops assume you have no experience and will help build your coding abilities from the ground up."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Do I need to attend both the learnathon and hackathon?",
		"content": "No, you can attend either one or both days! However, only participants who participate in track workshops during the learnathon or submit a project for the hackathon will be eligible for swag."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "How will teams work? What if I don't have a team?",
		"content": "During our hackathon, you'll have the opportunity to create a project in a team of up to 4 students. Don't worry if you don't have a team now—we'll have team formation and ideation sessions, so there'll be plenty of time to meet new people!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Why is there an application?",
		"content": "While we want to open Blueprint to everyone, having an application allows us to provide a better event experience with respect to planning and logistics. However, you definitely do not need any experience to apply. We're looking for people who are passionate about learning and creating!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "I have more questions!",
		"content": "Feel free to reach out to us at blueprint@hackmit.org for any questions, concerns, or just to say hi! :)"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "When is Blueprint?",
		"content": "Blueprint will be from March 2 to March 3! The learnathon will be on Saturday and the hackathon on Sunday."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Where is Blueprint?",
		"content": "The Saturday learnathon will take place at MIT's Tang Center (70 Memorial Dr, Cambridge, MA 02139). The Sunday hackathon will take place at the MIT Media Lab (75 Amherst St, Cambridge, MA 02139)."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Will Blueprint be fully in-person?",
		"content": "Yes!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Am I eligible to attend?",
		"content": "If you're a high school student, we invite you to apply - no coding experience required! Blueprint will teach you all you need to know to compete in your first hackathon, so beginners are more than welcome!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Does Blueprint cost money?",
		"content": "Admission is free and includes mentors, workshops, swag, resources, and an unforgettable experience!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "What will I eat?",
		"content": "We will provide breakfast and lunch for Saturday's learnathon, and breakfast, lunch, snacks, and dinner for Sunday's hackathon for free! We also have options for those with dietary restrictions."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "When is the application deadline?",
		"content": "Applications are due February 5!"
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Can I volunteer to judge or mentor?",
		"content": "Yes! Fill out the form here to sign up as a judge or mentor."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Are you doing travel reimbursements?",
		"content": "Due to logistical & financial restrictions, we cannot reimburse travel or lodging expenses for this event, and in order to provide our attendees with the best possible experience, we will not be able to accommodate virtual hackers."
	},
	{
		"source": "https://blueprint.hackmit.org/#faq",
		"question": "Will you be hosting students?",
		"content": "Unfortunately, MIT administration has strict requirements regarding hosting minors on campus, so we would not be able to match you with a host through the Blueprint team. If you aren’t able to commute to Blueprint and happen to know an MIT student or a student in the Boston area, you could try reaching out to them personally to see if they are able to host you!"
	},
	{
		"source": "https://blueprint.hackmit.org/#about",
		"question": "What is Blueprint?",
		"content": "Blueprint 2023 is a weekend-long learnathon and hackathon for high school students hosted at MIT."
	},
	{
		"source": "https://blueprint.hackmit.org/#about",
		"question": "When is BP Week?",
		"content": "BP Week will be from February 14 to February 18."
	},
	{
		"source": "https://blueprint.hackmit.org/#about",
		"question": "What is BP Week?",
		"content": "BP Week is a chance to join the hacker community before the weekend start! You will Meet fellow hackers through speed-friending and mini events, tune into tech talks by MIT student clubs and other organizations, and get a head start on learning at Blueprint with beginner workshops."
	},
	{
		"source": "https://blueprint.hackmit.org/#about",
		"question": "When is the Learnathon?",
		"content": "The Learnathon will be on February 19."
	},
	{
		"source": "https://blueprint.hackmit.org/#about",
		"question": "When is the Hackathon?",
		"content": "The Hackathon will be on February 20."
	},
	{
		"source": "https://blueprint.hackmit.org/#tracks",
		"question": "What are the tracks?",
		"content": "There will be five tracks: Start Hacking, Beginner Web Dev, Advanced Web Dev, Game Dev, and Hardware."
	},
	{
		"source": "https://blueprint.hackmit.org/#tracks",
		"question": "What is the Start Hacking track?",
		"content": "Start Hacking is meant to introduce Blueprint attendees (whether first-time coders or not) to hackathons. This track is taught in Python and intended to set hackers up with the resources they need to successfully complete a hackathon project. These projects serve as starting points for further participation in hackathons and programming at large."
	},
	{
		"source": "https://blueprint.hackmit.org/#tracks",
		"question": "What is the Web Dev track?",
		"content": "Web dev gives participants the ability to develop web apps from scratch. There are two subtracks. The first will be for beginners to expose people to HTML, CSS, and Javascript -- the essence of web applications. The second will be an advanced section for people already familiar with those languages, which will build upon the basics and teach React.js and databases. Advanced web dev is meant to expose people to build more complex and interactive web applications!"
	},
	{
		"source": "https://blueprint.hackmit.org/#tracks",
		"question": "What is the Game Dev track?",
		"content": "Want to learn how to build your own games? This track is a chance for hackers to boost their skills in game design. Hackers and their teams will design games starting from ideation to a ready-to-ship product. This track is taught using a variety of tools from Python to Lua. Hackers with creative talents outside of programming have the opportunity to apply their skills in this track. Minimal coding experience is recommended."
	},
	{
		"source": "https://blueprint.hackmit.org/#tracks",
		"question": "What is the Hardware track?",
		"content": "Hardware gives participants the hands-on experience of wiring/experimenting with various electrical pieces as well as learning how to utilize that hardware in code! We will start from the very beginning, teaching students how to use the basics of the C language and the Arduino software. We also guide participants through the basics of making a circuit and how they work. The hardware track is meant to expose students to the intersection of electrical engineering and computer science (EECS)."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Should we bring money?",
		"content": "The event will be entirely free, including breakfast/lunch on saturday and breakfast/lunch/dinner on Sunday."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Will there be recordings of the Zoom talks?",
		"content": "Yes, we expect to have recordings of the talks."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Do we need to bring any items for the hardware track, or are we supplied?",
		"content": "Students will be supplied an Arduino kit that inlcudes most of the necessary components, but if there are any specific components you want to use, you can bring them. However, be sure to bring a laptop and charger with the required software!"
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Will I be able to charage my laptop if it runs out of battery?",
		"content": "Please bring a charger if you can!"
	},
	{
		"source": "bluepring 2023 discord",
		"question": "What are the requirements for teams?",
		"content": "Teams will have at most 4 people."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Are there awards/competitions for each track or in general?",
		"content": "Yes, there will be awards for the tracks during the Hackathon. However, there will be no learnathon-workshop-specific prizes, since not everybody who attends the hackathon will have attended the learnathon."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Are there awards/competitions for each track or in general?",
		"content": "Yes, there will be awards for the tracks during the Hackathon. However, there will be no learnathon-workshop-specific prizes, since not everybody who attends the hackathon will have attended the learnathon."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "What's the difference between the beginner web dev track and the advanced web dev track?",
		"content": "Beginner Web Dev focuses on HTML/CSS/JavaScript, and is aimed at people with little or no web dev experience, while Advanced Web Dev assumes comfort with HTML/CSS/JS and focuses on more advanced concepts like React and databases"
	},
	{
		"source": "bluepring 2023 discord",
		"question": "What would be good to know beforehand for mobile app dev? (like languages, etc.)",
		"content": "Technically we just require some prior experience with coding (any language) — but we’ll be using React Native, so it might be good to brush up on your HTML/CSS/JavaScript if you've learned those in the past. There are also resources on the website if you scroll down to Tracks and click each individual track. These are not prerequisites but they just give you an idea of the kind of material we’re covering."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Is the track you choose binding? (Ex: if I choose hardware then do I have to do a hardware project?)",
		"content": "No, the track you choose is not binding."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Is there a required attire?",
		"content": "No, there is not a required attire."
	},
	{
		"source": "bluepring 2023 discord",
		"question": "Should we bring snacks?",
		"content": "Snacks will be provided, but if you have any favorites, feel free to bring them!"
	}
]